// З допомогою циклу while вивести всі прості числа в проміжку від 0 до 100

let i = 0;
while (i <= 100) {
    if (i === 0 || i === 1) {
        i++;
        continue;
    }
    let j = 2;
    while (j <= i) {
        if (i % j === 0) {
            break;
        }
        j++;
    }
    if (i === j) {
        console.log(i);
    }
    i++;
}

// З допомогою циклу do…while написати функцію для виведення чисел від 0 до 10, щоб результат виводу був відповідний зразку:

let i2 = 0;
do {
    if (i2 === 0) {
        console.log(i2 + ' - це нуль');
    } else if (i2 % 2 === 0) {
        console.log(i2 + ' - це парне число');
    } else {
        console.log(i2 + ' - це непарне число');
    }
    i2++;
} while (i2 <= 10)